/*
 * Kinetis - CAN (Flex Controller Area Network module) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef KINETIS_CAN_H_
#define KINETIS_CAN_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/kinetis/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_KINETIS_CAN DEVICE_PATH_KINETIS "CAN"

// ----------------------------------------------------------------------------

// Note: the "port-index" property has type "int".
typedef enum {
    // TODO: keep this list in ascending order.
    KINETIS_PORT_CAN0,
    KINETIS_PORT_CAN_UNDEFINED = 0xFF,
} kinetis_can_index_t;

// ----------------------------------------------------------------------------

#define TYPE_KINETIS_CAN TYPE_KINETIS_PREFIX "can" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_KINETIS_CAN_PARENT TYPE_PERIPHERAL
typedef PeripheralClass KinetisCANParentClass;
typedef PeripheralState KinetisCANParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define KINETIS_CAN_GET_CLASS(obj) \
    OBJECT_GET_CLASS(KinetisCANClass, (obj), TYPE_KINETIS_CAN)
#define KINETIS_CAN_CLASS(klass) \
    OBJECT_CLASS_CHECK(KinetisCANClass, (klass), TYPE_KINETIS_CAN)

typedef struct {
    // private: 
    KinetisCANParentClass parent_class;
    // public: 

    // None, so far.
} KinetisCANClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define KINETIS_CAN_STATE(obj) \
    OBJECT_CHECK(KinetisCANState, (obj), TYPE_KINETIS_CAN)

typedef struct {
    // private:
    KinetisCANParentState parent_obj;
    // public:

    const KinetisCapabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    // Remove it if there is only one port
    kinetis_can_index_t port_index;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // K6 CAN (Flex Controller Area Network module) registers.
        struct { 
          Object *mcr; // 0 (Module Configuration Register) 
          Object *ctrl1; // 0x4 (Control 1 register) 
          Object *timer; // 0x8 (Free Running Timer) 
          Object *rxmgmask; // 0x10 (Rx Mailboxes Global Mask Register) 
          Object *rx14mask; // 0x14 (Rx 14 Mask register) 
          Object *rx15mask; // 0x18 (Rx 15 Mask register) 
          Object *ecr; // 0x1C (Error Counter) 
          Object *esr1; // 0x20 (Error and Status 1 register) 
          Object *imask1; // 0x28 (Interrupt Masks 1 register) 
          Object *iflag1; // 0x30 (Interrupt Flags 1 register) 
          Object *ctrl2; // 0x34 (Control 2 register) 
          Object *esr2; // 0x38 (Error and Status 2 register) 
          Object *crcr; // 0x44 (CRC Register) 
          Object *rxfgmask; // 0x48 (Rx FIFO Global Mask register) 
          Object *rxfir; // 0x4C (Rx FIFO Information Register) 
          Object *cs0; // 0x80 (Message Buffer 0 CS Register) 
          Object *id0; // 0x84 (Message Buffer 0 ID Register) 
          Object *word00; // 0x88 (Message Buffer 0 WORD0 Register) 
          Object *word10; // 0x8C (Message Buffer 0 WORD1 Register) 
          Object *cs1; // 0x90 (Message Buffer 1 CS Register) 
          Object *id1; // 0x94 (Message Buffer 1 ID Register) 
          Object *word01; // 0x98 (Message Buffer 1 WORD0 Register) 
          Object *word11; // 0x9C (Message Buffer 1 WORD1 Register) 
          Object *cs2; // 0xA0 (Message Buffer 2 CS Register) 
          Object *id2; // 0xA4 (Message Buffer 2 ID Register) 
          Object *word02; // 0xA8 (Message Buffer 2 WORD0 Register) 
          Object *word12; // 0xAC (Message Buffer 2 WORD1 Register) 
          Object *cs3; // 0xB0 (Message Buffer 3 CS Register) 
          Object *id3; // 0xB4 (Message Buffer 3 ID Register) 
          Object *word03; // 0xB8 (Message Buffer 3 WORD0 Register) 
          Object *word13; // 0xBC (Message Buffer 3 WORD1 Register) 
          Object *cs4; // 0xC0 (Message Buffer 4 CS Register) 
          Object *id4; // 0xC4 (Message Buffer 4 ID Register) 
          Object *word04; // 0xC8 (Message Buffer 4 WORD0 Register) 
          Object *word14; // 0xCC (Message Buffer 4 WORD1 Register) 
          Object *cs5; // 0xD0 (Message Buffer 5 CS Register) 
          Object *id5; // 0xD4 (Message Buffer 5 ID Register) 
          Object *word05; // 0xD8 (Message Buffer 5 WORD0 Register) 
          Object *word15; // 0xDC (Message Buffer 5 WORD1 Register) 
          Object *cs6; // 0xE0 (Message Buffer 6 CS Register) 
          Object *id6; // 0xE4 (Message Buffer 6 ID Register) 
          Object *word06; // 0xE8 (Message Buffer 6 WORD0 Register) 
          Object *word16; // 0xEC (Message Buffer 6 WORD1 Register) 
          Object *cs7; // 0xF0 (Message Buffer 7 CS Register) 
          Object *id7; // 0xF4 (Message Buffer 7 ID Register) 
          Object *word07; // 0xF8 (Message Buffer 7 WORD0 Register) 
          Object *word17; // 0xFC (Message Buffer 7 WORD1 Register) 
          Object *cs8; // 0x100 (Message Buffer 8 CS Register) 
          Object *id8; // 0x104 (Message Buffer 8 ID Register) 
          Object *word08; // 0x108 (Message Buffer 8 WORD0 Register) 
          Object *word18; // 0x10C (Message Buffer 8 WORD1 Register) 
          Object *cs9; // 0x110 (Message Buffer 9 CS Register) 
          Object *id9; // 0x114 (Message Buffer 9 ID Register) 
          Object *word09; // 0x118 (Message Buffer 9 WORD0 Register) 
          Object *word19; // 0x11C (Message Buffer 9 WORD1 Register) 
          Object *cs10; // 0x120 (Message Buffer 10 CS Register) 
          Object *id10; // 0x124 (Message Buffer 10 ID Register) 
          Object *word010; // 0x128 (Message Buffer 10 WORD0 Register) 
          Object *word110; // 0x12C (Message Buffer 10 WORD1 Register) 
          Object *cs11; // 0x130 (Message Buffer 11 CS Register) 
          Object *id11; // 0x134 (Message Buffer 11 ID Register) 
          Object *word011; // 0x138 (Message Buffer 11 WORD0 Register) 
          Object *word111; // 0x13C (Message Buffer 11 WORD1 Register) 
          Object *cs12; // 0x140 (Message Buffer 12 CS Register) 
          Object *id12; // 0x144 (Message Buffer 12 ID Register) 
          Object *word012; // 0x148 (Message Buffer 12 WORD0 Register) 
          Object *word112; // 0x14C (Message Buffer 12 WORD1 Register) 
          Object *cs13; // 0x150 (Message Buffer 13 CS Register) 
          Object *id13; // 0x154 (Message Buffer 13 ID Register) 
          Object *word013; // 0x158 (Message Buffer 13 WORD0 Register) 
          Object *word113; // 0x15C (Message Buffer 13 WORD1 Register) 
          Object *cs14; // 0x160 (Message Buffer 14 CS Register) 
          Object *id14; // 0x164 (Message Buffer 14 ID Register) 
          Object *word014; // 0x168 (Message Buffer 14 WORD0 Register) 
          Object *word114; // 0x16C (Message Buffer 14 WORD1 Register) 
          Object *cs15; // 0x170 (Message Buffer 15 CS Register) 
          Object *id15; // 0x174 (Message Buffer 15 ID Register) 
          Object *word015; // 0x178 (Message Buffer 15 WORD0 Register) 
          Object *word115; // 0x17C (Message Buffer 15 WORD1 Register) 
          Object *rximr[16]; // 0x880 (Rx Individual Mask Registers) 
        } reg;

        struct { 

          // MCR (Module Configuration Register) bitfields.
          struct { 
            Object *maxmb; // [0:6] Number Of The Last Message Buffer
            Object *idam; // [8:9] ID Acceptance Mode
            Object *aen; // [12:12] Abort Enable
            Object *lprioen; // [13:13] Local Priority Enable
            Object *irmq; // [16:16] Individual Rx Masking And Queue Enable
            Object *srxdis; // [17:17] Self Reception Disable
            Object *waksrc; // [19:19] Wake Up Source
            Object *lpmack; // [20:20] Low-Power Mode Acknowledge
            Object *wrnen; // [21:21] Warning Interrupt Enable
            Object *slfwak; // [22:22] Self Wake Up
            Object *supv; // [23:23] Supervisor Mode
            Object *frzack; // [24:24] Freeze Mode Acknowledge
            Object *softrst; // [25:25] Soft Reset
