/*
 * Kinetis - ENET (Ethernet MAC-NET Core) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef KINETIS_ENET_H_
#define KINETIS_ENET_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/kinetis/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_KINETIS_ENET DEVICE_PATH_KINETIS "ENET"


// ----------------------------------------------------------------------------

#define TYPE_KINETIS_ENET TYPE_KINETIS_PREFIX "enet" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_KINETIS_ENET_PARENT TYPE_PERIPHERAL
typedef PeripheralClass KinetisENETParentClass;
typedef PeripheralState KinetisENETParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define KINETIS_ENET_GET_CLASS(obj) \
    OBJECT_GET_CLASS(KinetisENETClass, (obj), TYPE_KINETIS_ENET)
#define KINETIS_ENET_CLASS(klass) \
    OBJECT_CLASS_CHECK(KinetisENETClass, (klass), TYPE_KINETIS_ENET)

typedef struct {
    // private: 
    KinetisENETParentClass parent_class;
    // public: 

    // None, so far.
} KinetisENETClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define KINETIS_ENET_STATE(obj) \
    OBJECT_CHECK(KinetisENETState, (obj), TYPE_KINETIS_ENET)

typedef struct {
    // private:
    KinetisENETParentState parent_obj;
    // public:

    const KinetisCapabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // K6 ENET (Ethernet MAC-NET Core) registers.
        struct { 
          Object *eir; // 0x4 (Interrupt Event Register) 
          Object *eimr; // 0x8 (Interrupt Mask Register) 
          Object *rdar; // 0x10 (Receive Descriptor Active Register) 
          Object *tdar; // 0x14 (Transmit Descriptor Active Register) 
          Object *ecr; // 0x24 (Ethernet Control Register) 
          Object *mmfr; // 0x40 (MII Management Frame Register) 
          Object *mscr; // 0x44 (MII Speed Control Register) 
          Object *mibc; // 0x64 (MIB Control Register) 
          Object *rcr; // 0x84 (Receive Control Register) 
          Object *tcr; // 0xC4 (Transmit Control Register) 
          Object *palr; // 0xE4 (Physical Address Lower Register) 
          Object *paur; // 0xE8 (Physical Address Upper Register) 
          Object *opd; // 0xEC (Opcode/Pause Duration Register) 
          Object *iaur; // 0x118 (Descriptor Individual Upper Address Register) 
          Object *ialr; // 0x11C (Descriptor Individual Lower Address Register) 
          Object *gaur; // 0x120 (Descriptor Group Upper Address Register) 
          Object *galr; // 0x124 (Descriptor Group Lower Address Register) 
          Object *tfwr; // 0x144 (Transmit FIFO Watermark Register) 
          Object *rdsr; // 0x180 (Receive Descriptor Ring Start Register) 
          Object *tdsr; // 0x184 (Transmit Buffer Descriptor Ring Start Register) 
          Object *mrbr; // 0x188 (Maximum Receive Buffer Size Register) 
          Object *rsfl; // 0x190 (Receive FIFO Section Full Threshold) 
          Object *rsem; // 0x194 (Receive FIFO Section Empty Threshold) 
          Object *raem; // 0x198 (Receive FIFO Almost Empty Threshold) 
          Object *rafl; // 0x19C (Receive FIFO Almost Full Threshold) 
          Object *tsem; // 0x1A0 (Transmit FIFO Section Empty Threshold) 
          Object *taem; // 0x1A4 (Transmit FIFO Almost Empty Threshold) 
          Object *tafl; // 0x1A8 (Transmit FIFO Almost Full Threshold) 
          Object *tipg; // 0x1AC (Transmit Inter-Packet Gap) 
          Object *ftrl; // 0x1B0 (Frame Truncation Length) 
          Object *tacc; // 0x1C0 (Transmit Accelerator Function Configuration) 
          Object *racc; // 0x1C4 (Receive Accelerator Function Configuration) 
          Object *rmon_t_packets; // 0x204 (Tx Packet Count Statistic Register) 
          Object *rmon_t_bc_pkt; // 0x208 (Tx Broadcast Packets Statistic Register) 
          Object *rmon_t_mc_pkt; // 0x20C (Tx Multicast Packets Statistic Register) 
          Object *rmon_t_crc_align; // 0x210 (Tx Packets with CRC/Align Error Statistic Register) 
          Object *rmon_t_undersize; // 0x214 (Tx Packets Less Than Bytes and Good CRC Statistic Register) 
          Object *rmon_t_oversize; // 0x218 (Tx Packets GT MAX_FL bytes and Good CRC Statistic Register) 
          Object *rmon_t_frag; // 0x21C (Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register) 
          Object *rmon_t_jab; // 0x220 (Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register) 
          Object *rmon_t_col; // 0x224 (Tx Collision Count Statistic Register) 
          Object *rmon_t_p64; // 0x228 (Tx 64-Byte Packets Statistic Register) 
          Object *rmon_t_p65to127; // 0x22C (Tx 65- to 127-byte Packets Statistic Register) 
          Object *rmon_t_p128to255; // 0x230 (Tx 128- to 255-byte Packets Statistic Register) 
          Object *rmon_t_p256to511; // 0x234 (Tx 256- to 511-byte Packets Statistic Register) 
          Object *rmon_t_p512to1023; // 0x238 (Tx 512- to 1023-byte Packets Statistic Register) 
          Object *rmon_t_p1024to2047; // 0x23C (Tx 1024- to 2047-byte Packets Statistic Register) 
          Object *rmon_t_p_gte2048; // 0x240 (Tx Packets Greater Than 2048 Bytes Statistic Register) 
          Object *rmon_t_octets; // 0x244 (Tx Octets Statistic Register) 
          Object *ieee_t_frame_ok; // 0x24C (Frames Transmitted OK Statistic Register) 
          Object *ieee_t_1col; // 0x250 (Frames Transmitted with Single Collision Statistic Register) 
          Object *ieee_t_mcol; // 0x254 (Frames Transmitted with Multiple Collisions Statistic Register) 
          Object *ieee_t_def; // 0x258 (Frames Transmitted after Deferral Delay Statistic Register) 
          Object *ieee_t_lcol; // 0x25C (Frames Transmitted with Late Collision Statistic Register) 
          Object *ieee_t_excol; // 0x260 (Frames Transmitted with Excessive Collisions Statistic Register) 
          Object *ieee_t_macerr; // 0x264 (Frames Transmitted with Tx FIFO Underrun Statistic Register) 
          Object *ieee_t_cserr; // 0x268 (Frames Transmitted with Carrier Sense Error Statistic Register) 
          Object *ieee_t_fdxfc; // 0x270 (Flow Control Pause Frames Transmitted Statistic Register) 
          Object *ieee_t_octets_ok; // 0x274 (Octet Count for Frames Transmitted w/o Error Statistic Register) 
          Object *rmon_r_packets; // 0x284 (Rx Packet Count Statistic Register) 
          Object *rmon_r_bc_pkt; // 0x288 (Rx Broadcast Packets Statistic Register) 
          Object *rmon_r_mc_pkt; // 0x28C (Rx Multicast Packets Statistic Register) 
          Object *rmon_r_crc_align; // 0x290 (Rx Packets with CRC/Align Error Statistic Register) 
          Object *rmon_r_undersize; // 0x294 (Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register) 
          Object *rmon_r_oversize; // 0x298 (Rx Packets Greater Than MAX_FL and Good CRC Statistic Register) 
          Object *rmon_r_frag; // 0x29C (Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register) 
          Object *rmon_r_jab; // 0x2A0 (Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register) 
          Object *rmon_r_p64; // 0x2A8 (Rx 64-Byte Packets Statistic Register) 
          Object *rmon_r_p65to127; // 0x2AC (Rx 65- to 127-Byte Packets Statistic Register) 
          Object *rmon_r_p128to255; // 0x2B0 (Rx 128- to 255-Byte Packets Statistic Register) 
          Object *rmon_r_p256to511; // 0x2B4 (Rx 256- to 511-Byte Packets Statistic Register) 
          Object *rmon_r_p512to1023; // 0x2B8 (Rx 512- to 1023-Byte Packets Statistic Register) 
          Object *rmon_r_p1024to2047; // 0x2BC (Rx 1024- to 2047-Byte Packets Statistic Register) 
          Object *rmon_r_p_gte2048; // 0x2C0 (Rx Packets Greater than 2048 Bytes Statistic Register) 
          Object *rmon_r_octets; // 0x2C4 (Rx Octets Statistic Register) 
          Object *ieee_r_drop; // 0x2C8 (Frames not Counted Correctly Statistic Register) 
          Object *ieee_r_frame_ok; // 0x2CC (Frames Received OK Statistic Register) 
          Object *ieee_r_crc; // 0x2D0 (Frames Received with CRC Error Statistic Register) 
          Object *ieee_r_align; // 0x2D4 (Frames Received with Alignment Error Statistic Register) 
          Object *ieee_r_macerr; // 0x2D8 (Receive FIFO Overflow Count Statistic Register) 
          Object *ieee_r_fdxfc; // 0x2DC (Flow Control Pause Frames Received Statistic Register) 
          Object *ieee_r_octets_ok; // 0x2E0 (Octet Count for Frames Received without Error Statistic Register) 
          Object *atcr; // 0x400 (Adjustable Timer Control Register) 
          Object *atvr; // 0x404 (Timer Value Register) 
          Object *atoff; // 0x408 (Timer Offset Register) 
          Object *atper; // 0x40C (Timer Period Register) 
          Object *atcor; // 0x410 (Timer Correction Register) 
          Object *atinc; // 0x414 (Time-Stamping Clock Period Register) 
          Object *atstmp; // 0x418 (Timestamp of Last Transmitted Frame) 
          Object *tgsr; // 0x604 (Timer Global Status Register) 
          Object *tcsr[4]; // 0x608 (Timer Control Status Register) 
          Object *tccr[4]; // 0x60C (Timer Compare Capture Register) 
        } reg;

        struct { 

          // EIR (Interrupt Event Register) bitfields.
          struct { 
            Object *ts_timer; // [15:15] Timestamp Timer
            Object *ts_avail; // [16:16] Transmit Timestamp Available
            Object *wakeup; // [17:17] Node Wakeup Request Indication
            Object *plr; // [18:18] Payload Receive Error
            Object *un; // [19:19] Transmit FIFO Underrun
            Object *rl; // [20:20] Collision Retry Limit
            Object *lc; // [21:21] Late Collision
            Object *eberr; // [22:22] Ethernet Bus Error
            Object *mii; // [23:23] MII Interrupt.
            Object *rxb; // [24:24] Receive Buffer Interrupt
            Object *rxf; // [25:25] Receive Frame Interrupt
            Object *txb; // [26:26] Transmit Buffer Interrupt
            Object *txf; // [27:27] Transmit Frame Interrupt
